# แบบฝึกหัด 2

---

จากข้อมูล titanic.csv ให้ทำการวิเคราะห์ข้อมูลเบื้องต้นเกี่ยวกับคอลัมน์ cabin  
โดยแผนภาพด้านล่างนี้เป็นตำแหน่งของ cabin ตามตัวอักษรตัวแรกของรหัส cabin ที่บันทึกในชุดข้อมูล

![titanic-cabin](https://upload.wikimedia.org/wikipedia/commons/thumb/0/0d/Olympic_%26_Titanic_cutaway_diagram.png/800px-Olympic_%26_Titanic_cutaway_diagram.png)

ให้นิสิตสร้างคอลัมน์เพิ่ม โดยคอลัมน์ที่เพิ่มมานี้ จะเก็บข้อมูลของตัวอักษรตัวแรกที่ปรากฏในคอลัมน์ Cabin เช่น  
- หากในคอลัมน์ Cabin เป็นค่า "C123" ในคอลัมน์ที่สร้างจะบันทึก "C"  
- หากในคอลัมน์ Cabin เป็นค่า "C23 C25 C27" ในคอลัมน์ที่สร้างจะบันทึก "C" 
- หากในคอลัมน์ Cabin เป็นค่า "B58 B60 C2" ในคอลัมน์ที่สร้างจะบันทึก "B" 
- หากในคอลัมน์ Cabin เป็นค่า "F2" ในคอลัมน์ที่สร้างจะบันทึก "F" 
- หากในคอลัมน์ Cabin เป็นค่า NaN ในคอลัมน์ที่สร้างจะบันทึก NaN

จากนั้นให้นิสิตเขียนโค้ดเพื่อตอบคำถามในแต่ละข้อ

In [1]:
import numpy as np
import pandas as pd

In [2]:
''' from google.colab import drive
drive.mount('/content/drive') '''

" from google.colab import drive\ndrive.mount('/content/drive') "

In [3]:
df = pd.read_csv("titanic.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

นิสิตแสดงวิธีสร้างคอลัมน์

In [4]:
df['CabinLetter'] = df['Cabin'].str[0]

In [6]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,CabinLetter
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,NaN
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,NaN
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,C
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,NaN
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,B
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,NaN
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,NaN

1. ในแต่ละตัวอักษร Cabin มีจำนวนผู้โดยสารกี่คน และมีจำนวน NaN เท่าไหร่

In [8]:
df['CabinLetter'].value_counts(dropna = False)

NaN    687
C       59
B       47
D       33
E       32
A       15
F       13
G        4
T        1
Name: CabinLetter, dtype: int64

2. ในแต่ละตัวอักษร Cabin มีจำนวนผู้โดยสารที่รอดและเสียชีวิตอย่างละเท่าไหร่ cabin ใดมีจำนวนผู้เสียชีวิตมากที่สุด

In [16]:
CabinLetterSurvived = pd.crosstab(df['CabinLetter'], df['Survived'], margins=0)
CabinLetterSurvived.sort_values(by=0, ascending=0)

Survived      0   1
CabinLetter
C            24  35
B            12  35
A             8   7
D             8  25
E             8  24
F             5   8
G             2   2
T             1   0

In [36]:
CabinLetterSurvived.index[np.argmax(CabinLetterSurvived[0])]

'C'

3. cabin ใดมีค่า ratio ผู้รอดชีวิต / ผู้เสียชีวิต สูงสุด

In [38]:
CabinLetterSurvived['ratio'] = CabinLetterSurvived[1] / CabinLetterSurvived[0]
CabinLetterSurvived.sort_values(by='ratio', ascending=0)

Survived      0   1     ratio
CabinLetter
D             8  25  3.125000
E             8  24  3.000000
B            12  35  2.916667
F             5   8  1.600000
C            24  35  1.458333
G             2   2  1.000000
A             8   7  0.875000
T             1   0  0.000000

In [45]:
CabinLetterSurvived.index[np.argmax(CabinLetterSurvived['ratio'])]

'D'

3. cabin ใดมีค่าเฉลี่ยราคาตั๋ว (Fare) สูงสุด

In [50]:
df.filter(['Fare', 'CabinLetter']).groupby(['CabinLetter']).mean().sort_values(by='Fare', ascending=0)

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
CabinLetter,,,,,,,
B,521.808511,0.744681,1.000000,34.955556,0.361702,0.574468,113.505764
C,406.440678,0.593220,1.000000,36.086667,0.644068,0.474576,100.151341
D,475.939394,0.757576,1.121212,39.032258,0.424242,0.303030,57.244576
E,502.437500,0.750000,1.312500,38.116667,0.312500,0.312500,46.026694
A,439.600000,0.466667,1.000000,44.833333,0.133333,0.133333,39.623887
T,340.000000,0.000000,1.000000,45.000000,0.000000,0.000000,35.500000
F,370.384615,0.615385,2.384615,19.954545,0.538462,0.538462,18.696792
G,216.000000,0.500000,3.000000,14.750000,0.500000,1.250000,13.581250

4. จงแสดงค่าเฉลี่ยราคาตั๋ว (Fare) ของผู้รอดชีวิต และผู้เสียชีวิต ในแต่ละ cabin หากเปรียบเทียบราคาเฉลี่ยของผู้ที่รอดและเสียชีวิตจะพบว่า

In [51]:
df.filter(['Survived', 'Fare', 'CabinLetter']).groupby(['CabinLetter', 'Survived']).mean()

                            Fare
CabinLetter Survived
A           0          35.496350
            1          44.341071
B           0          57.137500
            1         132.832026
C           0          99.972396
            1         100.274046
D           0          53.770825
            1          58.356176
E           0          43.715625
            1          46.797050
F           0          11.340000
            1          23.294787
G           0          10.462500
            1          16.700000
T           0          35.500000

ค่าเฉลี่ยราคาตั๋วผู้รอดสูงกว่าผู้เสียชีวิต (แต่ยังไม่สามารถสรุปได้ว่ามีนัยสำคัญหรือไม่)

5. ในแต่ละ cabin มีจำนวนผู้โดยสารแยกตาม Pclass อย่างละกี่คน

In [52]:
pd.crosstab(df['CabinLetter'], df['Pclass'])

Pclass        1  2  3
CabinLetter
A            15  0  0
B            47  0  0
C            59  0  0
D            29  4  0
E            25  4  3
F             0  8  5
G             0  0  4
T             1  0  0